package com.example.ningyuwen.music.model.entity.lyric;

/**
 * 歌词
 * Created by ningyuwen on 17-10-10.
 */

public class Lyric {


    /**
     * kalaokLyric : [ti:她说]
     [ar:林俊杰]
     [co:林俊杰]
     [lr:孙燕姿]
     [by:8188731@网易云音乐]
     [#:http://music.163.com/#/song?id=108242]
     [5097,2858]
     [8053,8982]
     [25091,5857](0,613)她(0,312)静(0,313)悄(0,375)悄(0,375)的(0,312)来(0,3557)过
     [30747,5984](0,612)她(0,313)慢(0,250)慢(0,375)带(0,312)走(0,375)承(0,3747)诺
     [36416,5800](0,550)只(0,313)是(0,250)最(0,375)后(0,312)的(0,313)承(0,3687)诺
     [42066,5919](0,612)还(0,376)是(0,312)没(0,313)有(0,312)带(0,313)走(0,1125)了(0,187)寂(0,2369)寞
     [48028,5925](0,613)我(0,312)们(0,313)爱(0,373)的(0,252)没(0,375)有(0,3687)错
     [53080,4544](0,675)只(0,313)是(0,374)美(0,438)丽(0,375)的(0,312)独(0,2057)秀
     [58033,2454](0,485)太(0,876)折(0,1093)磨
     [60050,1920](0,550)她(0,310)说(0,276)无(0,289)所(0,495)谓
     [64724,6671](0,613)只(0,312)要(0,313)能(0,437)在(0,313)夜(0,375)里(0,311)翻(0,314)来(0,248)覆(0,377)去(0,312)的(0,313)时(0,375)候(0,375)有(0,437)寄(0,1246)托
     [71062,2425](0,609)等(0,316)不(0,313)到(0,312)天(0,875)黑
     [73074,3731](0,550)烟(0,313)火(0,250)不(0,312)会(0,375)太(0,374)完(0,1557)美
     [77018,6358](0,614)回(0,313)忆(0,375)烧(0,310)成(0,690)灰(0,250)还(0,313)是(0,312)等(0,313)不(0,375)到(0,251)结(0,2242)尾
     [83063,3042](0,550)她(0,311)曾(0,314)说(0,375)的(0,311)无(0,314)所(0,867)谓
     [86038,5890](0,613)我(0,312)怕(0,313)一(0,375)天(0,313)一(0,373)天(0,248)被(0,1004)摧(0,2339)毁
     [94022,5854](0,675)等(0,247)不(0,315)到(0,375)天(0,813)黑(0,312)不(0,250)敢(0,375)凋(0,313)谢(0,358)的(0,329)花(0,1492)蕾
     [99078,5107](0,615)绿(0,312)叶(0,313)在(0,375)跟(0,874)随(0,251)放(0,312)开(0,375)刺(0,313)痛(0,250)的(0,245)滋(0,872)味
     [104088,4851](0,550)今(0,313)后(0,313)不(0,396)再(0,228)怕(0,434)天(0,2617)明
     [110051,5796](0,596)我(0,267)想(0,310)只(0,315)是(0,375)害(0,375)怕(0,1500)清(0,2058)醒
     [144057,5672](0,488)她(0,250)静(0,250)悄(0,357)悄(0,268)的(0,312)来(0,3747)过
     [150004,4297](0,487)她(0,375)慢(0,309)慢(0,316)带(0,336)走(0,227)承(0,2247)诺
     [155068,5175](0,613)只(0,312)是(0,375)最(0,250)后(0,313)的(0,375)承(0,2937)诺
     [161024,5737](0,612)还(0,313)是(0,335)没(0,290)有(0,375)带(0,375)走(0,1188)了(0,250)寂(0,1999)寞
     [166099,4169](0,612)我(0,250)们(0,312)爱(0,250)的(0,313)没(0,375)有(0,2057)错
     [172049,4049](0,612)只(0,312)是(0,376)美(0,312)丽(0,375)的(0,375)独(0,1687)秀
     [176075,2640](0,612)太(0,875)折(0,1153)磨
     [178409,4207](0,527)她(0,250)说(0,313)无(0,312)所(0,2805)谓
     [183082,6606](0,613)只(0,312)要(0,250)能(0,438)在(0,375)夜(0,312)里(0,375)翻(0,310)来(0,378)覆(0,312)去(0,438)的(0,375)时(0,313)候(0,374)有(0,375)寄(0,1056)托
     [189735,2323](0,613)等(0,249)不(0,313)到(0,313)天(0,835)黑
     [191737,3773](0,612)烟(0,286)火(0,316)不(0,312)会(0,375)太(0,375)完(0,1497)美
     [195085,2427](0,552)回(0,312)忆(0,313)烧(0,375)成(0,875)灰
     [197397,4342](0,613)还(0,312)是(0,313)等(0,375)不(0,397)到(0,375)结(0,1957)尾
     [201734,2987](0,488)她(0,312)曾(0,250)说(0,375)的(0,313)无(0,312)所(0,937)谓
     [204702,5984](0,550)我(0,312)怕(0,313)一(0,312)天(0,313)一(0,375)天(0,373)被(0,877)摧(0,2559)毁
     [212079,2356](0,613)等(0,311)不(0,314)到(0,313)天(0,805)黑
     [214085,3627](0,675)不(0,312)敢(0,313)凋(0,312)谢(0,375)的(0,313)花(0,1327)蕾
     [218054,2270](0,590)绿(0,250)叶(0,312)在(0,313)跟(0,805)随
     [220052,3167](0,550)放(0,375)开(0,250)刺(0,375)痛(0,375)的(0,375)滋(0,867)味
     [223040,4675](0,636)今(0,289)后(0,314)不(0,374)再(0,310)怕(0,315)天(0,2437)明
     [228402,6606](0,675)我(0,313)想(0,312)只(0,356)是(0,332)害(0,312)怕(0,1438)清(0,2868)醒
     [235058,2230](0,550)等(0,250)不(0,273)到(0,352)天(0,805)黑
     [237052,3800](0,611)烟(0,314)火(0,375)不(0,437)会(0,438)太(0,438)完(0,1187)美
     [240702,6607](0,612)回(0,272)忆(0,291)烧(0,313)成(0,874)灰(0,375)还(0,313)是(0,437)等(0,313)不(0,625)到(0,250)结(0,1932)尾
     [246751,2859](0,550)她(0,312)曾(0,311)说(0,314)的(0,250)无(0,375)所(0,747)谓
     [250007,5729](0,675)我(0,375)怕(0,313)一(0,312)天(0,313)一(0,375)天(0,312)被(0,625)摧(0,2429)毁
     [257096,5253](0,611)等(0,314)不(0,313)到(0,375)天(0,750)黑(0,253)不(0,313)敢(0,312)凋(0,375)谢(0,313)的(0,312)花(0,1012)蕾
     [263058,5353](0,550)绿(0,312)叶(0,313)在(0,312)跟(0,1000)随(0,250)放(0,313)开(0,312)刺(0,375)痛(0,313)的(0,421)滋(0,882)味
     [268064,11953](0,552)今(0,250)后(0,376)不(0,312)再(0,375)怕(0,335)天(0,2750)明(0,318)我(0,312)想(0,250)只(0,1688)是(0,250)害(0,312)怕(0,1188)清(0,2685)醒
     [281015,3666](0,550)不(0,312)怕(0,250)天(0,2554)明
     [285058,8692](0,612)我(0,313)想(0,312)只(0,375)是(0,500)害(0,1750)怕(0,1392)清(0,3438)醒

     * kalaokVersion : 5
     * lyric : [00:00.00] 作曲 : 林俊杰
     [00:01.00] 作词 : 孙燕姿
     [00:26.040]她静悄悄的来过
     [00:31.389]她慢慢带走承诺
     [00:37.009]只是最后的承诺
     [00:42.599]还是没有带走了寂寞
     [00:48.289]我们爱的没有错
     [00:54.590]只是美丽的独秀
     [00:58.139]太折磨
     [01:00.319]她说无所谓
     [01:05.229]只要能在夜里翻来覆去的时候有寄托
     [01:11.589]等不到天黑
     [01:13.540]烟火不会太完美
     [01:17.279]回忆烧成灰
     [01:19.169]还是等不到结尾
     [01:23.999]她曾说的无所谓
     [01:26.169]我怕一天一天被摧毁
     [01:33.419]等不到天黑
     [01:36.178]不敢凋谢的花蕾
     [01:40.400]绿叶在跟随
     [01:42.299]放开刺痛的滋味
     [01:45.499]今后不再怕天明
     [01:50.359]我想只是害怕清醒
     [02:24.390]她静悄悄的来过
     [02:30.080]她慢慢带走承诺
     [02:35.610]只是最后的承诺
     [02:40.950]还是没有带走了寂寞
     [02:47.300]我们爱的没有错
     [02:52.450]只是美丽的独秀
     [02:56.590]太折磨
     [02:59.490]她说无所谓
     [03:03.900]只要能在夜里翻来覆去的时候有寄托
     [03:11.060]等不到天黑
     [03:12.760]烟火不会太完美
     [03:16.400]回忆烧成灰
     [03:18.000]还是等不到结尾
     [03:21.860]她曾说的无所谓
     [03:24.770]我怕一天一天被摧毁
     [03:33.100]等不到天黑
     [03:35.400]不敢凋谢的花蕾
     [03:38.770]绿叶在跟随
     [03:40.720]放开刺痛的滋味
     [03:43.630]今后不再怕天明
     [03:49.360]我想只是害怕清醒
     [03:55.810]等不到天黑
     [03:58.000]烟火不会太完美
     [04:01.550]回忆烧成灰
     [04:03.580]还是等不到结尾
     [04:07.940]她曾说的无所谓
     [04:10.580]我怕一天一天被摧毁
     [04:18.800]等不到天黑
     [04:20.579]不敢凋谢的花蕾
     [04:24.070]绿叶在跟随
     [04:26.150]放开刺痛的滋味
     [04:29.120]今后不再怕天明
     [04:34.880]我想只是害怕清醒
     [04:41.630]不怕天明
     [04:46.080]我想只是害怕清醒

     * lyricInfoType : Lyric_Loaded_Or_Update
     * lyricUserId : 0
     * lyricUserOffset : -1
     * lyricUserTime : 0
     * lyricVersion : 21
     * musicId : 108242
     * qfy : false
     * transUserId : 0
     * transUserTime : 0
     * translateLyric :
     * translateVersion : 0
     */

    private String kalaokLyric;
    private int kalaokVersion;
    private String lyric;
    private String lyricInfoType;
    private int lyricUserId;
    private int lyricUserOffset;
    private int lyricUserTime;
    private int lyricVersion;
    private int musicId;
    private boolean qfy;
    private int transUserId;
    private int transUserTime;
    private String translateLyric;
    private int translateVersion;

    public String getKalaokLyric() {
        return kalaokLyric;
    }

    public void setKalaokLyric(String kalaokLyric) {
        this.kalaokLyric = kalaokLyric;
    }

    public int getKalaokVersion() {
        return kalaokVersion;
    }

    public void setKalaokVersion(int kalaokVersion) {
        this.kalaokVersion = kalaokVersion;
    }

    public String getLyric() {
        return lyric;
    }

    public void setLyric(String lyric) {
        this.lyric = lyric;
    }

    public String getLyricInfoType() {
        return lyricInfoType;
    }

    public void setLyricInfoType(String lyricInfoType) {
        this.lyricInfoType = lyricInfoType;
    }

    public int getLyricUserId() {
        return lyricUserId;
    }

    public void setLyricUserId(int lyricUserId) {
        this.lyricUserId = lyricUserId;
    }

    public int getLyricUserOffset() {
        return lyricUserOffset;
    }

    public void setLyricUserOffset(int lyricUserOffset) {
        this.lyricUserOffset = lyricUserOffset;
    }

    public int getLyricUserTime() {
        return lyricUserTime;
    }

    public void setLyricUserTime(int lyricUserTime) {
        this.lyricUserTime = lyricUserTime;
    }

    public int getLyricVersion() {
        return lyricVersion;
    }

    public void setLyricVersion(int lyricVersion) {
        this.lyricVersion = lyricVersion;
    }

    public int getMusicId() {
        return musicId;
    }

    public void setMusicId(int musicId) {
        this.musicId = musicId;
    }

    public boolean isQfy() {
        return qfy;
    }

    public void setQfy(boolean qfy) {
        this.qfy = qfy;
    }

    public int getTransUserId() {
        return transUserId;
    }

    public void setTransUserId(int transUserId) {
        this.transUserId = transUserId;
    }

    public int getTransUserTime() {
        return transUserTime;
    }

    public void setTransUserTime(int transUserTime) {
        this.transUserTime = transUserTime;
    }

    public String getTranslateLyric() {
        return translateLyric;
    }

    public void setTranslateLyric(String translateLyric) {
        this.translateLyric = translateLyric;
    }

    public int getTranslateVersion() {
        return translateVersion;
    }

    public void setTranslateVersion(int translateVersion) {
        this.translateVersion = translateVersion;
    }
}
